# Operations

In [88]:
import numpy as np
import pandas as pd

In [89]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [90]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### info on Unique Values

In [92]:
df['col2'].unique() #mostly use

array([444, 555, 666], dtype=int64)

In [93]:
df['col2'].nunique() #mostly use

3

In [94]:
df['col2'].value_counts() #mostly use

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Selecting Data

In [96]:
df[df['col1']==2]

   col1  col2 col3
1     2   555  def

In [97]:
#we can use & | also

In [98]:
def sq(x):
    return x**2

In [99]:
df['col1'].apply(sq)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [100]:
#we can use default - inbuilt functions

In [101]:
df['col1'].sum()

10

In [102]:
#to drop column - using del

In [103]:
del df['col1']

In [104]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [105]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [106]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [107]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### Sort

In [109]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [110]:
#to find null value

In [111]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [112]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### hierarical -replace - pivot table

In [115]:

df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})

# Pivoting the DataFrame
pivot_df = df.pivot(index='col1', columns='col2', values='col3')
print(pivot_df)

col2  444  555  666
col1
1     abc  NaN  NaN
2     NaN  def  NaN
3     NaN  NaN  ghi
4     xyz  NaN  NaN